app/Http/Controllers/PostController.php

select * from `likes` where `likes`.`post_id` in (20, 21, 22, 23) and `likes`.`deleted_at` is null
select * from `posts` order by `created_at` desc limit 4 offset 0
select * from `users` where `users`.`id` in (1, 2, 3)
select count(*) as aggregate from `posts`
---
    public function index()
    {
        //  Get posts from the database
        //  There are a number of ways to pull this data from the database

        //  Where
//        $posts = Post::where();

        //  Find - Find a post by id
//        $posts = Post::find(1);

        //  Get - Returns all posts in their natural order * ALL POSTS
        //  This will give us a Laravel Collection
//        $posts = Post::get();

        //  Paginate posts
//        $posts = Post::Paginate(2);
//        $posts = Post::simplePaginate(4)->latest();
//        $posts = Post::simplePaginate(3)->sortByDesc("id");
//        $posts = Post::simplePaginate(3);
//        $posts = Post::Paginate(2)->sortByDesc("id");

//        $posts = Post::orderBy('id', 'desc')->simplePaginate(2);
//        $posts = Post::orderBy('id', 'desc')->Paginate(4);

//        $posts = Post::Paginate(2);

//        dd($posts);

//        Eager Loading
        $posts = Post::with(['user', 'likes'])->orderBy('created_at', 'desc')->Paginate(4);

insert into `posts` (`body`, `user_id`, `updated_at`, `created_at`) values ('I\'m back', 1, '2022-04-17 13:32:59', '2022-04-17 13:32:59')
---
    public function store(Request $request)
    {
        //  Validate
        $this->validate($request, [
           'body' => 'required'
        ]);

        //  Create post through user
//        $request->user()->posts()->create([
//            'body' => $request->body
//        ]);

        //  Another option of how to do this without user an array
        $request->user()->posts()->create($request->only('body'));