app/Http/Controllers/UserPostController.php

select * from `likes` where `likes`.`post_id` in (21) and `likes`.`deleted_at` is null
select * from `posts` where `posts`.`user_id` = 3 and `posts`.`user_id` is not null limit 4 offset 0
select * from `users` where `users`.`id` in (3)
select count(*) as aggregate from `posts` where `posts`.`user_id` = 3 and `posts`.`user_id` is not null
---
    public function index(User $user)
    {
        $posts = $user->posts()->with(['user', 'likes'])->paginate(4);